princeton/ipvs/results/archive/feedback-wrr/httperf_client_126.log
httperf --verbose --hog --timeout=50 --client=0/1 --server=172.16.116.116 --port=8080 --uri=/ --rate=24 --send-buffer=4096 --recv-buffer=16384 --num-conns=480 --num-calls=1
httperf: maximum number of open descriptors = 65535
Maximum connect burst length: 1

Connection lifetime histogram (time in ms):
             :
             9.5 3
            10.5 134
            11.5 107
            12.5 36
            13.5 23
            14.5 20
            15.5 40
            16.5 44
            17.5 26
            18.5 6
            19.5 3
            20.5 6
            21.5 2
            22.5 2
            23.5 1
            24.5 1
            25.5 1
             :
            27.5 3
            28.5 1
            29.5 2
            30.5 1
            31.5 1
             :
            35.5 1
             :
            39.5 1
             :
            43.5 1
            44.5 1
             :
            46.5 1
             :
            56.5 1
            57.5 1
            58.5 1
             :
            68.5 1
             :
            83.5 1
             :
            94.5 1
             :
           501.5 1
             :
           521.5 1
             :
           558.5 1
             :
           608.5 1
             :
           633.5 1
             :
           809.5 1

Total: connections 480 requests 480 replies 480 test-duration 20.025 s

Connection rate: 24.0 conn/s (41.7 ms/conn, <=4 concurrent connections)
Connection time [ms]: min 10.0 avg 21.8 max 809.1 median 11.5 stddev 67.2
Connection time [ms]: connect 0.5
Connection length [replies/conn]: 1.000

Request rate: 24.0 req/s (41.7 ms/req)
Request size [B]: 67.0

Reply rate [replies/s]: min 21.0 avg 23.9 max 27.0 stddev 1.2 (20 samples)
Percentages of the replies served at a given rate:
   50%: 23
   66%: 23
   75%: 23
   80%: 23
   90%: 24
   95%: 25
   98%: 26
   99%: 26
  100%: 27

Reply time [ms]: response 19.9 transfer 1.4
Percentages of the requests served within a certain time (ms) :
   50%: 10
   66%: 13
   75%: 14
   80%: 15
   90%: 16
   95%: 24
   98%: 56
   99%: 498
  100%: 632

Reply size [B]: header 162.0 content 72.0 footer 1.0 (total 235.0)
Reply status: 1xx=0 2xx=480 3xx=0 4xx=0 5xx=0

CPU time [s]: user 16.42 system 3.57 (user 82.0% system 17.8% total 99.8%)
Net I/O: 7.1 KB/s (0.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0